app/controllers/administration/items_controller.rb

    def update
      @item = Item.find(params[:id])
      if params[:item][:discount_percentage].to_f < 100
        @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "items" SET "discount_percentage" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["discount_percentage", 90], ["updated_at", "2019-01-15 13:23:52.066696"], ["id", 3]]